Merge pull request #18 from jhd3197/dev
Add setup step & creation context analysis
